yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al3l8a.h
#define DMA1_C0M0ARL_M0A0        DMA1_C0M0ARL_bit.M0A0
#define DMA1_C0M0ARL_M0A1        DMA1_C0M0ARL_bit.M0A1
#define DMA1_C0M0ARL_M0A2        DMA1_C0M0ARL_bit.M0A2
#define DMA1_C0M0ARL_M0A3        DMA1_C0M0ARL_bit.M0A3
#define DMA1_C0M0ARL_M0A4        DMA1_C0M0ARL_bit.M0A4
#define DMA1_C0M0ARL_M0A5        DMA1_C0M0ARL_bit.M0A5
#define DMA1_C0M0ARL_M0A6        DMA1_C0M0ARL_bit.M0A6
#define DMA1_C0M0ARL_M0A7        DMA1_C0M0ARL_bit.M0A7

#define DMA1_C1CR_EN             DMA1_C1CR_bit.EN
#define DMA1_C1CR_TCIE           DMA1_C1CR_bit.TCIE
#define DMA1_C1CR_HTIE           DMA1_C1CR_bit.HTIE
#define DMA1_C1CR_DIR            DMA1_C1CR_bit.DIR
#define DMA1_C1CR_CIRC           DMA1_C1CR_bit.CIRC
#define DMA1_C1CR_MINCDEC        DMA1_C1CR_bit.MINCDEC

#define DMA1_C1SPR_TCIF          DMA1_C1SPR_bit.TCIF
#define DMA1_C1SPR_HTIF          DMA1_C1SPR_bit.HTIF
#define DMA1_C1SPR_TSIZE         DMA1_C1SPR_bit.TSIZE
#define DMA1_C1SPR_PL0           DMA1_C1SPR_bit.PL0
#define DMA1_C1SPR_PL1           DMA1_C1SPR_bit.PL1
#define DMA1_C1SPR_PEND          DMA1_C1SPR_bit.PEND
#define DMA1_C1SPR_BUSY          DMA1_C1SPR_bit.BUSY

#define DMA1_C1NDTR_NDT0         DMA1_C1NDTR_bit.NDT0
#define DMA1_C1NDTR_NDT1         DMA1_C1NDTR_bit.NDT1
#define DMA1_C1NDTR_NDT2         DMA1_C1NDTR_bit.NDT2
#define DMA1_C1NDTR_NDT3         DMA1_C1NDTR_bit.NDT3
#define DMA1_C1NDTR_NDT4         DMA1_C1NDTR_bit.NDT4
#define DMA1_C1NDTR_NDT5         DMA1_C1NDTR_bit.NDT5
#define DMA1_C1NDTR_NDT6         DMA1_C1NDTR_bit.NDT6
#define DMA1_C1NDTR_NDT7         DMA1_C1NDTR_bit.NDT7

#define DMA1_C1PARH_PA8          DMA1_C1PARH_bit.PA8
#define DMA1_C1PARH_PA9          DMA1_C1PARH_bit.PA9
#define DMA1_C1PARH_PA10         DMA1_C1PARH_bit.PA10
#define DMA1_C1PARH_PA11         DMA1_C1PARH_bit.PA11
#define DMA1_C1PARH_PA12         DMA1_C1PARH_bit.PA12
#define DMA1_C1PARH_PA13         DMA1_C1PARH_bit.PA13
#define DMA1_C1PARH_PA14         DMA1_C1PARH_bit.PA14
#define DMA1_C1PARH_PA15         DMA1_C1PARH_bit.PA15

#define DMA1_C1PARL_PA0          DMA1_C1PARL_bit.PA0
#define DMA1_C1PARL_PA1          DMA1_C1PARL_bit.PA1
#define DMA1_C1PARL_PA2          DMA1_C1PARL_bit.PA2
#define DMA1_C1PARL_PA3          DMA1_C1PARL_bit.PA3
#define DMA1_C1PARL_PA4          DMA1_C1PARL_bit.PA4
#define DMA1_C1PARL_PA5          DMA1_C1PARL_bit.PA5
#define DMA1_C1PARL_PA6          DMA1_C1PARL_bit.PA6
#define DMA1_C1PARL_PA7          DMA1_C1PARL_bit.PA7

#define DMA1_C1M0ARH_M0A8        DMA1_C1M0ARH_bit.M0A8
#define DMA1_C1M0ARH_M0A9        DMA1_C1M0ARH_bit.M0A9
#define DMA1_C1M0ARH_M0A10       DMA1_C1M0ARH_bit.M0A10
#define DMA1_C1M0ARH_M0A11       DMA1_C1M0ARH_bit.M0A11
#define DMA1_C1M0ARH_M0A12       DMA1_C1M0ARH_bit.M0A12
#define DMA1_C1M0ARH_M0A13       DMA1_C1M0ARH_bit.M0A13
#define DMA1_C1M0ARH_M0A14       DMA1_C1M0ARH_bit.M0A14
#define DMA1_C1M0ARH_M0A15       DMA1_C1M0ARH_bit.M0A15

#define DMA1_C1M0ARL_M0A0        DMA1_C1M0ARL_bit.M0A0
#define DMA1_C1M0ARL_M0A1        DMA1_C1M0ARL_bit.M0A1
#define DMA1_C1M0ARL_M0A2        DMA1_C1M0ARL_bit.M0A2
#define DMA1_C1M0ARL_M0A3        DMA1_C1M0ARL_bit.M0A3
#define DMA1_C1M0ARL_M0A4        DMA1_C1M0ARL_bit.M0A4
#define DMA1_C1M0ARL_M0A5        DMA1_C1M0ARL_bit.M0A5
#define DMA1_C1M0ARL_M0A6        DMA1_C1M0ARL_bit.M0A6
#define DMA1_C1M0ARL_M0A7        DMA1_C1M0ARL_bit.M0A7

#define DMA1_C2CR_EN             DMA1_C2CR_bit.EN
#define DMA1_C2CR_TCIE           DMA1_C2CR_bit.TCIE
#define DMA1_C2CR_HTIE           DMA1_C2CR_bit.HTIE
#define DMA1_C2CR_DIR            DMA1_C2CR_bit.DIR
#define DMA1_C2CR_CIRC           DMA1_C2CR_bit.CIRC
#define DMA1_C2CR_MINCDEC        DMA1_C2CR_bit.MINCDEC

#define DMA1_C2SPR_TCIF          DMA1_C2SPR_bit.TCIF
#define DMA1_C2SPR_HTIF          DMA1_C2SPR_bit.HTIF
#define DMA1_C2SPR_TSIZE         DMA1_C2SPR_bit.TSIZE
#define DMA1_C2SPR_PL0           DMA1_C2SPR_bit.PL0
#define DMA1_C2SPR_PL1           DMA1_C2SPR_bit.PL1
#define DMA1_C2SPR_PEND          DMA1_C2SPR_bit.PEND
#define DMA1_C2SPR_BUSY          DMA1_C2SPR_bit.BUSY

#define DMA1_C2NDTR_NDT0         DMA1_C2NDTR_bit.NDT0
#define DMA1_C2NDTR_NDT1         DMA1_C2NDTR_bit.NDT1
#define DMA1_C2NDTR_NDT2         DMA1_C2NDTR_bit.NDT2
#define DMA1_C2NDTR_NDT3         DMA1_C2NDTR_bit.NDT3
#define DMA1_C2NDTR_NDT4         DMA1_C2NDTR_bit.NDT4
#define DMA1_C2NDTR_NDT5         DMA1_C2NDTR_bit.NDT5
#define DMA1_C2NDTR_NDT6         DMA1_C2NDTR_bit.NDT6
#define DMA1_C2NDTR_NDT7         DMA1_C2NDTR_bit.NDT7

#define DMA1_C2PARH_PA8          DMA1_C2PARH_bit.PA8
#define DMA1_C2PARH_PA9          DMA1_C2PARH_bit.PA9
#define DMA1_C2PARH_PA10         DMA1_C2PARH_bit.PA10
#define DMA1_C2PARH_PA11         DMA1_C2PARH_bit.PA11
#define DMA1_C2PARH_PA12         DMA1_C2PARH_bit.PA12
#define DMA1_C2PARH_PA13         DMA1_C2PARH_bit.PA13
#define DMA1_C2PARH_PA14         DMA1_C2PARH_bit.PA14
#define DMA1_C2PARH_PA15         DMA1_C2PARH_bit.PA15

#define DMA1_C2PARL_PA0          DMA1_C2PARL_bit.PA0
#define DMA1_C2PARL_PA1          DMA1_C2PARL_bit.PA1
#define DMA1_C2PARL_PA2          DMA1_C2PARL_bit.PA2
#define DMA1_C2PARL_PA3          DMA1_C2PARL_bit.PA3
#define DMA1_C2PARL_PA4          DMA1_C2PARL_bit.PA4
#define DMA1_C2PARL_PA5          DMA1_C2PARL_bit.PA5
#define DMA1_C2PARL_PA6          DMA1_C2PARL_bit.PA6
#define DMA1_C2PARL_PA7          DMA1_C2PARL_bit.PA7

#define DMA1_C2M0ARH_M0A8        DMA1_C2M0ARH_bit.M0A8
#define DMA1_C2M0ARH_M0A9        DMA1_C2M0ARH_bit.M0A9
#define DMA1_C2M0ARH_M0A10       DMA1_C2M0ARH_bit.M0A10
#define DMA1_C2M0ARH_M0A11       DMA1_C2M0ARH_bit.M0A11
#define DMA1_C2M0ARH_M0A12       DMA1_C2M0ARH_bit.M0A12
#define DMA1_C2M0ARH_M0A13       DMA1_C2M0ARH_bit.M0A13
#define DMA1_C2M0ARH_M0A14       DMA1_C2M0ARH_bit.M0A14
#define DMA1_C2M0ARH_M0A15       DMA1_C2M0ARH_bit.M0A15

#define DMA1_C2M0ARL_M0A0        DMA1_C2M0ARL_bit.M0A0
#define DMA1_C2M0ARL_M0A1        DMA1_C2M0ARL_bit.M0A1
#define DMA1_C2M0ARL_M0A2        DMA1_C2M0ARL_bit.M0A2
#define DMA1_C2M0ARL_M0A3        DMA1_C2M0ARL_bit.M0A3
#define DMA1_C2M0ARL_M0A4        DMA1_C2M0ARL_bit.M0A4
#define DMA1_C2M0ARL_M0A5        DMA1_C2M0ARL_bit.M0A5
#define DMA1_C2M0ARL_M0A6        DMA1_C2M0ARL_bit.M0A6
#define DMA1_C2M0ARL_M0A7        DMA1_C2M0ARL_bit.M0A7

#define DMA1_C3CR_EN             DMA1_C3CR_bit.EN
#define DMA1_C3CR_TCIE           DMA1_C3CR_bit.TCIE
#define DMA1_C3CR_HTIE           DMA1_C3CR_bit.HTIE
#define DMA1_C3CR_DIR            DMA1_C3CR_bit.DIR
#define DMA1_C3CR_CIRC           DMA1_C3CR_bit.CIRC
#define DMA1_C3CR_MINCDEC        DMA1_C3CR_bit.MINCDEC
#define DMA1_C3CR_MEM            DMA1_C3CR_bit.MEM

