yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al3l8a.h
#define RTC_ISR2_ALRAF           RTC_ISR2_bit.ALRAF
#define RTC_ISR2_WUTF            RTC_ISR2_bit.WUTF
#define RTC_ISR2_TAMP1F          RTC_ISR2_bit.TAMP1F
#define RTC_ISR2_TAMP2F          RTC_ISR2_bit.TAMP2F
#define RTC_ISR2_TAMP3F          RTC_ISR2_bit.TAMP3F

#define RTC_SPRERH_PREDIV_S8     RTC_SPRERH_bit.PREDIV_S8
#define RTC_SPRERH_PREDIV_S9     RTC_SPRERH_bit.PREDIV_S9
#define RTC_SPRERH_PREDIV_S10    RTC_SPRERH_bit.PREDIV_S10
#define RTC_SPRERH_PREDIV_S11    RTC_SPRERH_bit.PREDIV_S11
#define RTC_SPRERH_PREDIV_S12    RTC_SPRERH_bit.PREDIV_S12
#define RTC_SPRERH_PREDIV_S13    RTC_SPRERH_bit.PREDIV_S13
#define RTC_SPRERH_PREDIV_S14    RTC_SPRERH_bit.PREDIV_S14

#define RTC_SPRERL_PREDIV_S0     RTC_SPRERL_bit.PREDIV_S0
#define RTC_SPRERL_PREDIV_S1     RTC_SPRERL_bit.PREDIV_S1
#define RTC_SPRERL_PREDIV_S2     RTC_SPRERL_bit.PREDIV_S2
#define RTC_SPRERL_PREDIV_S3     RTC_SPRERL_bit.PREDIV_S3
#define RTC_SPRERL_PREDIV_S4     RTC_SPRERL_bit.PREDIV_S4
#define RTC_SPRERL_PREDIV_S5     RTC_SPRERL_bit.PREDIV_S5
#define RTC_SPRERL_PREDIV_S6     RTC_SPRERL_bit.PREDIV_S6
#define RTC_SPRERL_PREDIV_S7     RTC_SPRERL_bit.PREDIV_S7

#define RTC_APRER_PREDIV_A       RTC_APRER_bit.PREDIV_A

#define RTC_WUTRH_WUT8           RTC_WUTRH_bit.WUT8
#define RTC_WUTRH_WUT9           RTC_WUTRH_bit.WUT9
#define RTC_WUTRH_WUT10          RTC_WUTRH_bit.WUT10
#define RTC_WUTRH_WUT11          RTC_WUTRH_bit.WUT11
#define RTC_WUTRH_WUT12          RTC_WUTRH_bit.WUT12
#define RTC_WUTRH_WUT13          RTC_WUTRH_bit.WUT13
#define RTC_WUTRH_WUT14          RTC_WUTRH_bit.WUT14
#define RTC_WUTRH_WUT15          RTC_WUTRH_bit.WUT15

#define RTC_WUTRL_WUT0           RTC_WUTRL_bit.WUT0
#define RTC_WUTRL_WUT1           RTC_WUTRL_bit.WUT1
#define RTC_WUTRL_WUT2           RTC_WUTRL_bit.WUT2
#define RTC_WUTRL_WUT3           RTC_WUTRL_bit.WUT3
#define RTC_WUTRL_WUT4           RTC_WUTRL_bit.WUT4
#define RTC_WUTRL_WUT5           RTC_WUTRL_bit.WUT5
#define RTC_WUTRL_WUT6           RTC_WUTRL_bit.WUT6
#define RTC_WUTRL_WUT7           RTC_WUTRL_bit.WUT7

#define RTC_SSRL_SS0             RTC_SSRL_bit.SS0
#define RTC_SSRL_SS1             RTC_SSRL_bit.SS1
#define RTC_SSRL_SS2             RTC_SSRL_bit.SS2
#define RTC_SSRL_SS3             RTC_SSRL_bit.SS3
#define RTC_SSRL_SS4             RTC_SSRL_bit.SS4
#define RTC_SSRL_SS5             RTC_SSRL_bit.SS5
#define RTC_SSRL_SS6             RTC_SSRL_bit.SS6
#define RTC_SSRL_SS7             RTC_SSRL_bit.SS7

#define RTC_SSRH_SS8             RTC_SSRH_bit.SS8
#define RTC_SSRH_SS9             RTC_SSRH_bit.SS9
#define RTC_SSRH_SS10            RTC_SSRH_bit.SS10
#define RTC_SSRH_SS11            RTC_SSRH_bit.SS11
#define RTC_SSRH_SS12            RTC_SSRH_bit.SS12
#define RTC_SSRH_SS13            RTC_SSRH_bit.SS13
#define RTC_SSRH_SS14            RTC_SSRH_bit.SS14
#define RTC_SSRH_SS15            RTC_SSRH_bit.SS15

#define RTC_WPR_KEY0             RTC_WPR_bit.KEY0
#define RTC_WPR_KEY1             RTC_WPR_bit.KEY1
#define RTC_WPR_KEY2             RTC_WPR_bit.KEY2
#define RTC_WPR_KEY3             RTC_WPR_bit.KEY3
#define RTC_WPR_KEY4             RTC_WPR_bit.KEY4
#define RTC_WPR_KEY5             RTC_WPR_bit.KEY5
#define RTC_WPR_KEY6             RTC_WPR_bit.KEY6
#define RTC_WPR_KEY7             RTC_WPR_bit.KEY7

#define RTC_SHIFTRH_SUBFS8       RTC_SHIFTRH_bit.SUBFS8
#define RTC_SHIFTRH_SUBFS9       RTC_SHIFTRH_bit.SUBFS9
#define RTC_SHIFTRH_SUBFS10      RTC_SHIFTRH_bit.SUBFS10
#define RTC_SHIFTRH_SUBFS11      RTC_SHIFTRH_bit.SUBFS11
#define RTC_SHIFTRH_SUBFS12      RTC_SHIFTRH_bit.SUBFS12
#define RTC_SHIFTRH_SUBFS13      RTC_SHIFTRH_bit.SUBFS13
#define RTC_SHIFTRH_SUBFS14      RTC_SHIFTRH_bit.SUBFS14
#define RTC_SHIFTRH_ADDIS        RTC_SHIFTRH_bit.ADDIS

#define RTC_SHIFTRL_SUBFS0       RTC_SHIFTRL_bit.SUBFS0
#define RTC_SHIFTRL_SUBFS1       RTC_SHIFTRL_bit.SUBFS1
#define RTC_SHIFTRL_SUBFS2       RTC_SHIFTRL_bit.SUBFS2
#define RTC_SHIFTRL_SUBFS3       RTC_SHIFTRL_bit.SUBFS3
#define RTC_SHIFTRL_SUBFS4       RTC_SHIFTRL_bit.SUBFS4
#define RTC_SHIFTRL_SUBFS5       RTC_SHIFTRL_bit.SUBFS5
#define RTC_SHIFTRL_SUBFS6       RTC_SHIFTRL_bit.SUBFS6
#define RTC_SHIFTRL_SUBFS7       RTC_SHIFTRL_bit.SUBFS7

#define RTC_ALRMAR1_ALSU         RTC_ALRMAR1_bit.ALSU
#define RTC_ALRMAR1_ALST         RTC_ALRMAR1_bit.ALST
#define RTC_ALRMAR1_MSK1         RTC_ALRMAR1_bit.MSK1

#define RTC_ALRMAR2_ALMNU        RTC_ALRMAR2_bit.ALMNU
#define RTC_ALRMAR2_ALMNT        RTC_ALRMAR2_bit.ALMNT
#define RTC_ALRMAR2_MSK2         RTC_ALRMAR2_bit.MSK2

#define RTC_ALRMAR3_ALHU         RTC_ALRMAR3_bit.ALHU
#define RTC_ALRMAR3_ALHT         RTC_ALRMAR3_bit.ALHT
#define RTC_ALRMAR3_PM           RTC_ALRMAR3_bit.PM
#define RTC_ALRMAR3_MSK3         RTC_ALRMAR3_bit.MSK3

#define RTC_ALRMAR4_ALDU         RTC_ALRMAR4_bit.ALDU
#define RTC_ALRMAR4_ALDT         RTC_ALRMAR4_bit.ALDT
#define RTC_ALRMAR4_WDSEL        RTC_ALRMAR4_bit.WDSEL
#define RTC_ALRMAR4_MSK4         RTC_ALRMAR4_bit.MSK4

#define RTC_ALRMASSRH_ALSS8      RTC_ALRMASSRH_bit.ALSS8
#define RTC_ALRMASSRH_ALSS9      RTC_ALRMASSRH_bit.ALSS9
#define RTC_ALRMASSRH_ALSS10     RTC_ALRMASSRH_bit.ALSS10
#define RTC_ALRMASSRH_ALSS11     RTC_ALRMASSRH_bit.ALSS11
#define RTC_ALRMASSRH_ALSS12     RTC_ALRMASSRH_bit.ALSS12
#define RTC_ALRMASSRH_ALSS13     RTC_ALRMASSRH_bit.ALSS13
#define RTC_ALRMASSRH_ALSS14     RTC_ALRMASSRH_bit.ALSS14

#define RTC_ALRMASSRL_ALSS0      RTC_ALRMASSRL_bit.ALSS0
#define RTC_ALRMASSRL_ALSS1      RTC_ALRMASSRL_bit.ALSS1
#define RTC_ALRMASSRL_ALSS2      RTC_ALRMASSRL_bit.ALSS2
#define RTC_ALRMASSRL_ALSS3      RTC_ALRMASSRL_bit.ALSS3
#define RTC_ALRMASSRL_ALSS4      RTC_ALRMASSRL_bit.ALSS4
#define RTC_ALRMASSRL_ALSS5      RTC_ALRMASSRL_bit.ALSS5
#define RTC_ALRMASSRL_ALSS6      RTC_ALRMASSRL_bit.ALSS6
#define RTC_ALRMASSRL_ALSS7      RTC_ALRMASSRL_bit.ALSS7

#define RTC_ALRMASSMSKR_MASKSS0  RTC_ALRMASSMSKR_bit.MASKSS0
#define RTC_ALRMASSMSKR_MASKSS1  RTC_ALRMASSMSKR_bit.MASKSS1
#define RTC_ALRMASSMSKR_MASKSS2  RTC_ALRMASSMSKR_bit.MASKSS2
#define RTC_ALRMASSMSKR_MASKSS3  RTC_ALRMASSMSKR_bit.MASKSS3

#define RTC_CALRH_CALM8          RTC_CALRH_bit.CALM8
#define RTC_CALRH_CALW16         RTC_CALRH_bit.CALW16
#define RTC_CALRH_CALW8          RTC_CALRH_bit.CALW8
#define RTC_CALRH_CALP           RTC_CALRH_bit.CALP

#define RTC_CALRL_CALM0          RTC_CALRL_bit.CALM0
#define RTC_CALRL_CALM1          RTC_CALRL_bit.CALM1
#define RTC_CALRL_CALM2          RTC_CALRL_bit.CALM2
#define RTC_CALRL_CALM3          RTC_CALRL_bit.CALM3
#define RTC_CALRL_CALM4          RTC_CALRL_bit.CALM4
#define RTC_CALRL_CALM5          RTC_CALRL_bit.CALM5
#define RTC_CALRL_CALM6          RTC_CALRL_bit.CALM6
#define RTC_CALRL_CALM7          RTC_CALRL_bit.CALM7

#define RTC_TCR1_TAMPIE          RTC_TCR1_bit.TAMPIE
#define RTC_TCR1_TAMP1E          RTC_TCR1_bit.TAMP1E
#define RTC_TCR1_TAMP1LEVEL      RTC_TCR1_bit.TAMP1LEVEL
#define RTC_TCR1_TAMP2E          RTC_TCR1_bit.TAMP2E
#define RTC_TCR1_TAMP2LEVEL      RTC_TCR1_bit.TAMP2LEVEL
#define RTC_TCR1_TAMP3E          RTC_TCR1_bit.TAMP3E
#define RTC_TCR1_TAMP3LEVEL      RTC_TCR1_bit.TAMP3LEVEL

#define RTC_TCR2_TAMPFREQ        RTC_TCR2_bit.TAMPFREQ
#define RTC_TCR2_TAMPFLT         RTC_TCR2_bit.TAMPFLT
#define RTC_TCR2_TAMPPRCH        RTC_TCR2_bit.TAMPPRCH
#define RTC_TCR2_TAMPPUDIS       RTC_TCR2_bit.TAMPPUDIS

#define CSS_LSE_CSR_CSSEN        CSS_LSE_CSR_bit.CSSEN
#define CSS_LSE_CSR_SWITCHEN     CSS_LSE_CSR_bit.SWITCHEN
#define CSS_LSE_CSR_CSSIE        CSS_LSE_CSR_bit.CSSIE
#define CSS_LSE_CSR_CSSF         CSS_LSE_CSR_bit.CSSF
#define CSS_LSE_CSR_SWITCHF      CSS_LSE_CSR_bit.SWITCHF

#endif

/*-------------------------------------------------------------------------
 *      RTC bit masks
 *-----------------------------------------------------------------------*/
#define MASK_RTC_TR1_SU          0x0F
#define MASK_RTC_TR1_ST          0xF0

#define MASK_RTC_TR2_MNU         0x0F
#define MASK_RTC_TR2_MNT         0xF0

#define MASK_RTC_TR3_HU          0x0F
#define MASK_RTC_TR3_HT          0x30
#define MASK_RTC_TR3_PM          0x40

#define MASK_RTC_DR1_DU          0x0F
#define MASK_RTC_DR1_DT          0x30

#define MASK_RTC_DR2_MU          0x0F
#define MASK_RTC_DR2_MT          0x10
#define MASK_RTC_DR2_WDU         0xE0

#define MASK_RTC_DR3_YU          0x0F
#define MASK_RTC_DR3_YT          0xF0

#define MASK_RTC_CR1_WUCKSEL     0x0F
#define MASK_RTC_CR1_RATIO       0x20
#define MASK_RTC_CR1_FMT         0x40

#define MASK_RTC_CR2_ALRAE       0x01
#define MASK_RTC_CR2_WUTE        0x04
#define MASK_RTC_CR2_ALRAIE      0x10
#define MASK_RTC_CR2_WUTIE       0x40

